package com.company;

import java.util.Scanner;

public class 관리자메뉴 {

    //관리자가 실행할 수 있는 항목들의 메뉴
    public static void 관리자메뉴(){
        System.out.println("-------------------------------------------------------------------------------MENU-------------------------------------------------------------------------------\n");
        System.out.println("                                                                　　  <1. 교수ㆍ학생 계정 생성>\n");
        System.out.println("                                                                 　　<2. 교과목 생성/수정/삭제>\n");
        System.out.println("                                                              　　<3. 개설 교과목 생성/수정/삭제>\n");
        System.out.println("                                                              　　<4. 강의 계획서 입력 기간 설정>\n");
        System.out.println("                                                              　　<5. 학년별 수강 신청 기간 설정>\n");
        System.out.println("                                                                   　<6. 교수/학생 정보 조회>\n");
        System.out.println("                                                                  　<7. 개설 교과목 정보 조회>\n");
        System.out.println("                                                                     　    <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    //관리자가 교수ㆍ학생 계정 생성을 선택한 경우 교수인지 학생인지 선택하는 메뉴
    public static void 교수학생계정생성선택메뉴(){
        System.out.println("------------------------------------------------------------------------교수ㆍ학생 계정 생성------------------------------------------------------------------------\n");
        System.out.println("                                                                             <1. 교수>\n");
        System.out.println("                                                                             <2. 학생>\n");
        System.out.println("                                                                         　<0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 계정을 생성하고자 하는 유형의 번호를 입력하세요. : ");
    }

    //교수 계정 생성에 필요한 정보를 보여주는 메뉴
    public static void 교수계정생성메뉴(){
        System.out.println("----------------------------------------------------------------------------교수 계정 생성--------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교번(사용자ID) 이름 비밀번호 주소 주민등록번호 전화번호 소속학과 교수실 교수실전화번호"); //사용자 유형은 자동생성되므로 입력 포맷에서 제외
        System.out.print(">> 생성하고자 하는 교수의 정보를 입력하세요. : ");
    }

    //학생 계정 생성에 필요한 정보를 보여주는 메뉴
    public static void 학생계정생성메뉴(){
        System.out.println("----------------------------------------------------------------------------학생 계정 생성--------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 학번(사용자ID) 이름 비밀번호 주소 주민등록번호 전화번호 소속학과 학년\n"); //사용자 유형은 자동생성되므로 입력 포맷에서 제외 / 신청과목수, 신청총학점은 수강신청 시 트리거를 통해 자동 변경
        System.out.print(">> 생성하고자 하는 학생의 정보를 입력하세요. : ");
    }

    //관리자가 교과목 생성/수정/삭제를 선택한 경우 생성, 수정, 삭제 중 무엇을 할 것인지 선택하는 메뉴
    public static void 교과목생성수정삭제선택메뉴(){
        System.out.println("------------------------------------------------------------------------교과목 생성/수정/삭제-----------------------------------------------------------------------\n");
        System.out.println("                                                                       　 <1. 교과목 생성>\n");
        System.out.println("                                                                       　 <2. 교과목 수정>\n");
        System.out.println("                                                                       　 <3. 교과목 삭제>\n");
        System.out.println("                                                                       　  <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    //교과목 생성에 필요한 정보를 보여주는 메뉴
    public static void 교과목생성메뉴(){
        System.out.println("-----------------------------------------------------------------------------교과목 생성-----------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교과목번호 교과목이름 대상학년(0~5) 교육과정 이수구분 학점 설계과목여부(true/false)\n"); //개설여부는 트리거를 통해 개설 시 true로 변경
        System.out.print(">> 생성하고자 하는 교과목의 정보를 입력하세요. : ");
    }

    //교과목의 어느 정보를 수정할 것인지 선택하는 메뉴
    public static void 교과목수정메뉴(){
        System.out.println("-----------------------------------------------------------------------------교과목 수정-----------------------------------------------------------------------------\n");
        System.out.print(">> 수정하고자 하는 교과목의 번호를 입력하세요. : ");
    }

    //수정할 교과목번호를 입력받기위한 메뉴
    public static void 교과목번호입력메뉴(){
        System.out.print(">> 설정하고자 하는 교과목 번호를 입력하세요. : ");
    }

    //설정하는 정보를 입력받는 메뉴
    public static void 설정정보입력메뉴(){
        System.out.print(">>  정보를 입력 형식에 맞게 입력하세요. : ");
    }

    public static void 교과목전체정보수정메뉴(){
        System.out.println("-------------------------------------------------------------------------교과목 전체 정보 수정------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교과목이름 대상학년(0~5) 교육과정 이수구분 학점 설계과목여부(true/false)\n");
    }

    public static void 교과목이름수정메뉴(){
        System.out.println("----------------------------------------------------------------------------교과목이름 수정--------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교과목이름\n");
        설정정보입력메뉴();
    }

    public static void 대상학년수정메뉴(){
        System.out.println("-----------------------------------------------------------------------------대상학년 수정---------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 대상학년(0~5)\n");
        설정정보입력메뉴();
    }

    public static void 교육과정수정메뉴(){
        System.out.println("-----------------------------------------------------------------------------교육과정 수정---------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교육과정\n");
        설정정보입력메뉴();
    }

    public static void 이수구분수정메뉴(){
        System.out.println("-----------------------------------------------------------------------------이수구분 수정---------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 이수구분\n");
        설정정보입력메뉴();
    }

    public static void 학점수정메뉴(){
        System.out.println("-------------------------------------------------------------------------------학점 수정-----------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 학점\n");
        설정정보입력메뉴();
    }

    public static void 설계과목여부수정메뉴(){
        System.out.println("--------------------------------------------------------------------------설계 과목 여부 수정------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 설계 과목 여부(true/false)\n");
        설정정보입력메뉴();
    }

    public static void 교과목삭제메뉴(){
        System.out.println("------------------------------------------------------------------------------교과목 삭제---------------------------------------------------------------------------\n");
        교과목번호입력메뉴();
    }

    //관리자가 개설교과목 생성/수정/삭제를 선택한 경우 생성, 수정, 삭제 중 무엇을 할 것인지 선택하는 메뉴
    public static void 개설교과목생성수정삭제선택메뉴(){
        System.out.println("----------------------------------------------------------------------개설 교과목 생성/수정/삭제--------------------------------------------------------------------\n");
        System.out.println("                                                                  　　   <1. 개설 교과목 생성>\n");
        System.out.println("                                                                  　　   <2. 개설 교과목 수정>\n");
        System.out.println("                                                                  　　   <3. 개설 교과목 삭제>\n");
        System.out.println("                                                                      　  　<0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 개설교과목생성메뉴(){
        System.out.println("--------------------------------------------------------------------------개설교과목 생성---------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교과목번호 최대수강인원 강의실 분반 수업요일 수업시작시간(HHMMSS) 수업종료시간(HHMMSS), 교번\n"); //수강신청기간, 강의계획서입력기간은 다른 메뉴에서 설정
        System.out.print(">> 생성하고자 하는 개설 교과목의 정보를 입력하세요. : ");
    }

    //강의계획 수정은 관리자가 아닌 담당 교수가 수정하는 것이 맞다고 생각하여 담당 교수에서 수정
    public static void 개설교과목수정메뉴(){
        System.out.println("--------------------------------------------------------------------------개설 교과목 수정--------------------------------------------------------------------------\n");
        System.out.print(">> 수정하고자 하는 교과목의 번호를 입력하세요. : ");
    }

    public static void 개설교과목전체정보수정메뉴(){
        System.out.println("----------------------------------------------------------------------개설 교과목 전체 정보 수정---------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 최대수강인원 강의실 분반\n");
        설정정보입력메뉴();
    }

    public static void 최대수강인원수정메뉴(){
        System.out.println("--------------------------------------------------------------------------최대 수강 인원 수정-----------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 최대수강인원\n");
        설정정보입력메뉴();
    }

    public static void 강의실수정메뉴(){
        System.out.println("------------------------------------------------------------------------------강의실 수정--------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 강의실\n");
        설정정보입력메뉴();
    }

    public static void 분반수정메뉴(){
        System.out.println("-------------------------------------------------------------------------------분반 수정----------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 분반\n");
        설정정보입력메뉴();
    }

    public static void 개설교과목삭제메뉴(){
        System.out.println("----------------------------------------------------------------------------개설교과목 삭제-------------------------------------------------------------------------\n");
        교과목번호입력메뉴();
    }

    public static void  강의계획서입력기간설정메뉴(){
        System.out.println("---------------------------------------------------------------------강의 계획서 입력 기간 설정----------------------------------------------------------------------\n");
        System.out.println("                                                    　　　 　<1. 강의 계획서 입력 시작, 종료 기간 설정>\n");
        System.out.println("                                                   　　　     　 <2. 강의 계획서 입력 시작 날짜 설정>\n");
        System.out.println("                                                      　　　   　<3. 강의 계획서 입력 종료 날짜 설정>\n");
        System.out.println("                                                                       　 <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 강의계획서입력시작종료기간설정메뉴(){
        System.out.println("-----------------------------------------------------------------강의 계획서 입력 시작, 종료 기간 설정----------------------------------------------------------------\n");
        System.out.println("<입력 형식> 강의계획서입력시작기간(YYYYMMDDHHMMSS) 강의계획서입력종료기간(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void 강의계획서입력시작기간설정메뉴(){
        System.out.println("--------------------------------------------------------------------강의 계획서 입력 시작 날짜 설정-------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 강의계획서입력시작날짜(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void 강의계획서입력종료기간설정메뉴(){
        System.out.println("--------------------------------------------------------------------강의 계획서 입력 종료 날짜 설정-------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 강의계획서입력종료날짜(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void  학년별수강신청기간설정메뉴(){
        System.out.println("-----------------------------------------------------------------------학년별 수강 신청 기간 설정--------------------------------------------------------------------\n");
        System.out.println("                                                  　　　   　　　<1. 학년별 수강 신청 시작, 종료 기간 설정>\n");
        System.out.println("                                                     　　   　　　<2. 학년별 수강 신청 시작 날짜 설정>\n");
        System.out.println("                                                     　　　  　　 <3. 학년별 수강 신청 종료 날짜 설정>\n");
        System.out.println("                                                                      　   　<0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 학년별수강신청시작종료기간설정메뉴(){
        System.out.println("------------------------------------------------------------------학년별 수강 신청 시작, 종료 기간 설정---------------------------------------------------------------\n");
        System.out.println("<입력 형식> 대상학년 학년별수강신청시작기간(YYYYMMDDHHMMSS) 학년별수강신청종료기간(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void 학년별수강신청시작기간설정메뉴(){
        System.out.println("--------------------------------------------------------------------학년별 수강 신청 시작 날짜 설정------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 대상학년 학년별수강신청시작날짜(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void 학년별수강신청종료기간설정메뉴(){
        System.out.println("--------------------------------------------------------------------학년별 수강 신청 종료 날짜 설정------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 대상학년 학년별수강신청종료날짜(YYYYMMDDHHMMSS)\n");
        설정정보입력메뉴();
    }

    public static void 교수학생정보조회메뉴(){
        System.out.println("-------------------------------------------------------------------------교수/학생 정보 조회------------------------------------------------------------------------\n");
        System.out.println("                                                                 　　    <1. 교수 정보 조회>\n");
        System.out.println("                                                                 　　    <2. 학생 정보 조회>\n");
        System.out.println("                                                                   　    　 <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 교수정보조회메뉴(){
        System.out.println("---------------------------------------------------------------------------교수 정보 조회---------------------------------------------------------------------------\n");
    }

    public static void 학생정보조회메뉴(){
        System.out.println("---------------------------------------------------------------------------학생 정보 조회---------------------------------------------------------------------------\n");
    }

    public static void 개설교과목정보조회메뉴(){
        System.out.println("------------------------------------------------------------------------개설 교과목 정보 조회-----------------------------------------------------------------------\n");
        System.out.println("                                                                        　  <1. 전체 조회>\n");
        System.out.println("                                                                     　　 <2. 교수별 조회>\n");
        System.out.println("                                                                     　    <3. 학년별 조회>\n");
        System.out.println("                                                                　　　  <4. 교수ㆍ학년별 조회>\n");
        System.out.println("                                                                      　    <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 개설교과목전체정보조회메뉴(){
        System.out.println("----------------------------------------------------------------------개설 교과목 전체 정보 조회---------------------------------------------------------------------\n");
    }

    public static void 개설교과목교수별정보조회메뉴(){
        System.out.println("---------------------------------------------------------------------개설 교과목 교수별 정보 조회--------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교수명\n");
        설정정보입력메뉴();
    }

    public static void 개설교과목학생별정보조회메뉴(){
        System.out.println("---------------------------------------------------------------------개설 교과목 학생별 정보 조회--------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 대상학년(0~5)\n");
        설정정보입력메뉴();
    }

    public static void 개설교과목교수학년별조회메뉴(){
        System.out.println("-------------------------------------------------------------------개설 교과목 교수ㆍ학년별 정보 조회----------------------------------------------------------------\n");
        System.out.println("<입력 형식> 교수명 대상학년(0~5)\n");
        설정정보입력메뉴();
    }
}
