package com.company;

public class 교수메뉴 {

    public static void 교수메뉴(){
        System.out.println("-------------------------------------------------------------------------------MENU-------------------------------------------------------------------------------\n");
        System.out.println("                                                            　　　 <1. 개인정보 및 비밀번호 수정>\n");
        System.out.println("                                                              　　  <2. 개설 교과목 목록 조회>\n");
        System.out.println("                                                             　　   <3. 강의 계획서 입력/수정>\n");
        System.out.println("                                                       　　　    <4. 개설 교과목 강의 계획서 조회>\n");
        System.out.println("                                                      　　　   <5. 교과목 수강 신청 학생 목록 조회>\n");
        System.out.println("                                                           　     　 <6. 교과목 시간표 조회>\n");
        System.out.println("                                                                     　  <0. 뒤로 가기>\n");
        System.out.println("-------------------------------------------------------------------------------로그인-------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");

    }

    public static void  교수실수정메뉴(){
        System.out.print(">> 변경할 교수실 위치 : ");
    }

    public static void 교수실전화번호수정메뉴(){
        System.out.print(">> 변경할 교수실 전화번호 : ");
    }

    public static void 강의계획서입력수정메뉴(){
        System.out.println("-------------------------------------------------------------------------강의 계획서 입력/수정-----------------------------------------------------------------------\n");
        System.out.println("                                                               　　     <1. 강의 계획서 입력>\n");
        System.out.println("                                                              　　      <2. 강의 계획서 수정>\n");
        System.out.println("                                                                   　 　   <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 강의계획서입력메뉴(){
        System.out.println("--------------------------------------------------------------------------강의 계획서 입력 메뉴----------------------------------------------------------------------\n");
        System.out.print(">> 강의 계획서를 입력하고자 하는 교과목 번호를 입력하세요. : ");
    }

    public static void 강의계획서수정메뉴(){
        System.out.println("--------------------------------------------------------------------------강의 계획서 수정 메뉴----------------------------------------------------------------------\n");
        System.out.print(">> 강의 계획서를 수정하고자 하는 교과목 번호를 입력하세요. : ");
    }

    //교수 자신이 담당하고 있는 강의 계획서만 조회
    public static void 개설교과목강의계획서조회메뉴(){
        System.out.println("-----------------------------------------------------------------------개설 교과목 강의 계획서 조회------------------------------------------------------------------\n");
    }

    public static void 강의계획서정보입력메뉴(){
        System.out.print(">> 강의 계획서 내용을 입력해주세요. : ");
    }

    public static void 교과목수강신청학생목록조회메뉴(){
        System.out.println("----------------------------------------------------------------------교과목 수강 신청 학생 목록 조회----------------------------------------------------------------\n");
        System.out.print(">> 조회하고자 하는 교과목 번호를 입력하세요. : ");
    }

    public static void 교과목시간표조회(){
        System.out.println("-----------------------------------------------------------------------------교과목 시간표 조회---------------------------------------------------------------------\n");
    }
}