package com.company;

public class 초기접속화면 {

    public static void 수강신청프로그램초기메뉴(){
        System.out.println("--------------------------------------------------------------------------수강신청프로그램--------------------------------------------------------------------------\n");
        System.out.println("                                                                            <1. 로그인>\n");
        System.out.println("                                                                     　　<2. 관리자 회원가입>\n");
        System.out.println("                                                                             <0. 종료>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 로그인메뉴(){
        System.out.println("-------------------------------------------------------------------------------로그인-------------------------------------------------------------------------------\n");
        System.out.print(">> ID : ");
    }

    //아이디에서 오류 없으면 호출해서 사용
    public static void 비밀번호메뉴(){
        System.out.print(">> PW : ");
    }

    public static void 관리자회원가입메뉴(){
        System.out.println("--------------------------------------------------------------------------관리자 회원가입---------------------------------------------------------------------------\n");
        System.out.println("<입력 형식> 사용자ID 이름 비밀번호 주소 주민등록번호 전화번호 소속학과"); //사용자 유형은 자동생성되므로 입력 포맷에서 제외
        System.out.print(">> 생성하고자 하는 관리자의 정보를 입력하세요. : ");
    }
}
