package com.company;

public class 학생메뉴 {

    public static void 학생메뉴(){
        System.out.println("-------------------------------------------------------------------------------MENU-------------------------------------------------------------------------------\n");
        System.out.println("                                                           　　   <1. 개인정보 및 비밀번호 수정>\n");
        System.out.println("                                                                　     <2. 수강 신청/취소>\n");
        System.out.println("                                                         　　   <3. 개설 교과목 목록(전학년) 조회>\n");
        System.out.println("                                                            　　 <4. 선택 교과목 강의 계획서 조회>\n");
        System.out.println("                                                                   　 <5. 본인 시간표 조회>\n");
        System.out.println("                                                                      　  <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 학년변경메뉴(){
        System.out.print(">> 변경할 학년 : ");
    }

    public static void 수강신청취소메뉴(){
        System.out.println("---------------------------------------------------------------------------수강 신청/취소---------------------------------------------------------------------------\n");
        System.out.println("                                                                     　    <1. 수강 신청>\n");
        System.out.println("                                                                     　    <2. 수강 취소>\n");
        System.out.println("                                                                      　   <0. 뒤로 가기>\n");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
        System.out.print(">> 이용하고자 하는 번호를 입력하세요. : ");
    }

    public static void 수강신청메뉴(){
        System.out.println("-----------------------------------------------------------------------------수강 신청------------------------------------------------------------------------------\n");
        System.out.print(">> 수강 신청할 과목의 교과목 번호를 입력하세요. : ");
    }

    public static void 수강취소메뉴(){
        System.out.println("-----------------------------------------------------------------------------수강 취소------------------------------------------------------------------------------\n");
        System.out.print(">> 수강 취소할 과목의 교과목 번호를 입력하세요. : ");
    }

    public static void 개설교과목목록전학년조회(){
        System.out.println("--------------------------------------------------------------------개설 교과목 목록(전학년) 조회--------------------------------------------------------------------\n");
    }

    public static void 선택교과목강의계획서조회(){
        System.out.println("--------------------------------------------------------------------선택 교과목 강의 계획서 조회---------------------------------------------------------------------\n");
        System.out.print(">> 강의 계획서를 조회할 교과목의 교과목 번호를 입력하세요. : ");
    }

    public static void 본인시간표조회(){
        System.out.println("--------------------------------------------------------------------------본인 시간표 조회--------------------------------------------------------------------------\n");
    }
}
